<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7d2e6524736c47332d458fc73ba1999506a638028641c3d9e096dad29d3a7df4","plan_job_ref":"Job Validations on PR #16 at https://github.com/SelfOverflow/discord-bots/actions/runs/22073109943","plan_out_hash":"4f03c8f1839f02deabf447f84277b1c6636ed088f0ee02cdf5a2fcdcd93c976d","plan_hash":"6f04859c9e40ee0df6dd81216849aaf4b40ef5914f7abdeeff259f37d137694b","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "ap-south-1"
+       tags                                 = {
+           "Name" = "main"
        }
+       tags_all                             = {
+           "Name" = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #5](https://github.com/SelfOverflow/discord-bots/actions/runs/22073158142)